argandas/STM32F746G-DISCO_TouchGFX_Demo-1/Core/Src/main.cpp
}

/* USER CODE BEGIN 4 */

UART_HandleTypeDef uart_console;

void com_init()
{
  BSP_COM_DeInit(COM1, &uart_console);
  BSP_COM_Init(COM1, &uart_console);
}

uint16_t cli_printf(const char* fmt, ...)
{
#if 0
    va_list  args;
    uint16_t len = 0;

    va_start(args, fmt);
    len = cli_varg_printf(fmt, args);
    va_end(args);

    return len;
#else
    char buff[32];
    va_list args;
    va_start(args, fmt);
    vsnprintf(buff, sizeof(buff), fmt, args);
    HAL_UART_Transmit(&huart1, (uint8_t*)buff, strlen(buff), 100);
    va_end(args);
#endif
    
    
}

uint16_t cli_write(const char* src, uint16_t len)
{
    HAL_UART_Transmit(&huart1, (uint8_t*)src, len, 100);
}

uint16_t cli_varg_printf(const char* fmt, va_list args)
{
    uint16_t len = 0;
    if (NULL != fmt)
    {
        //len = (uint16_t) tfp_vsnprintf(&cli_fmt_buffer[0], CLI_FMT_BUFFER_LEN, fmt, args);
    }
    return cli_write(fmt, strlen(fmt));
    // return cli_write(&cli_fmt_buffer[0], len);
}

void StartLEDTask(void const * argument)
{
  //char* string = "Hello World";
  uint8_t led_state = 0;

  BSP_LED_Init(LED_GREEN);
  BSP_LED_Off(LED_GREEN);
  
  // com_init();
    
  /* Infinite loop */
  for(;;)
  {
    if(xQueueReceive(ledQueueHandle, &led_state, 0) == pdTRUE)
    {
      if (led_state == 1)
      {
        BSP_LED_On(LED_GREEN);
      }
      else
      {
        BSP_LED_Off(LED_GREEN);
      }
      
      cli_printf("Model::p2m_SetLEDState: %d\r\n", led_state);
    }
    
    osDelay(20);
  }
}

void StartSDTask(void const * argument)
{
  
  FATFS fs;    /* Ponter to the filesystem object */
  FRESULT fr;   /* FatFs function common result code */
  char label[12];


  BSP_SD_Init();

  fr = f_mount(&SDFatFS, "", 1);
  cli_printf("f_mount: %d\r\n", fr);
  
  fr = f_open(&MyFile, "STM32.TXT", FA_CREATE_ALWAYS | FA_WRITE);
  cli_printf("f_open: %d\r\n", fr);
  
  
#if 0
    FRESULT res;                                        /* FatFs function common result code */
  uint32_t byteswritten, bytesread;                     /* File write/read counts */
  uint8_t wtext[] = "This is STM32 working with FatFs"; /* File write buffer */
  uint8_t rtext[100];                                   /* File read buffer */
  
  cli_printf("Step #%d\r\n", 1);
  /*##-1- Link the micro SD disk I/O driver ##################################*/
  // if(FATFS_LinkDriver(&SD_Driver, SDPath) == 0)
  {  
      cli_printf("Step #%d\r\n", 2);
    /*##-2- Register the file system object to the FatFs module ##############*/
    if(f_mount(&SDFatFs, (TCHAR const*)SDPath, 0) != FR_OK)
    {
      /* FatFs Initialization Error */
      Error_Handler();
    }
    else
    {
#if 1
        cli_printf("Step #%d\r\n", 3);

      /*##-3- Create a FAT file system (format) on the logical drive #########*/
      /* WARNING: Formatting the uSD card will delete all content on the device */
if(f_mkfs((TCHAR const*)SDPath, FM_ANY, 0, workBuffer, sizeof(workBuffer)) != FR_OK)
      {
        /* FatFs Format Error */
        Error_Handler();
      }
      else
#endif
      {
          cli_printf("Step #%d\r\n", 4);

        /*##-4- Create and Open a new text file object with write access #####*/
        if(f_open(&MyFile, "STM32.TXT", FA_CREATE_ALWAYS | FA_WRITE) != FR_OK)
        {
          /* 'STM32.TXT' file Open for write Error */
          Error_Handler();
        }
        else
        {
            cli_printf("Step #%d\r\n", 5);

          /*##-5- Write data to the text file ################################*/
          res = f_write(&MyFile, wtext, sizeof(wtext), (UINT *)&byteswritten);
          
          if((byteswritten == 0) || (res != FR_OK))
          {
            /* 'STM32.TXT' file Write or EOF Error */
            Error_Handler();
          }
          else
          {
              cli_printf("Step #%d\r\n", 6);

            /*##-6- Close the open text file #################################*/
            f_close(&MyFile);
            
              cli_printf("Step #%d\r\n", 7);

            /*##-7- Open the text file object with read access ###############*/
            if(f_open(&MyFile, "STM32.TXT", FA_READ) != FR_OK)
            {
              /* 'STM32.TXT' file Open for read Error */
              Error_Handler();
            }
            else
            {
                cli_printf("Step #%d\r\n", 8);

              /*##-8- Read data from the text file ###########################*/
              res = f_read(&MyFile, rtext, sizeof(rtext), (UINT*)&bytesread);
              
              if((bytesread == 0) || (res != FR_OK))
              {
                /* 'STM32.TXT' file Read or EOF Error */
                Error_Handler();
              }
              else
              {
                  cli_printf("Step #%d\r\n", 9);

                /*##-9- Close the open text file #############################*/
                f_close(&MyFile);
                
                  cli_printf("Step #%d\r\n", 10);

                /*##-10- Compare read data with the expected data ############*/
                if ((bytesread != byteswritten))
                {                
                  /* Read data is different from the expected data */
                  Error_Handler();
                }
                else
                {
                    cli_printf("SUCESS #%X\r\n", 255);

                  /* Success of the demo: no error occurrence */
                  BSP_LED_On(LED1);
                }
              }
            }
          }
        }
      }
    }
  }
  
                    cli_printf("Step #%d\r\n", 11);

  /*##-11- Unlink the micro SD disk I/O driver ###############################*/
  FATFS_UnLinkDriver(SDPath);
  
#endif
  /* Infinite Loop */
  for( ;; )
  {
  }

}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for FATFS */
  MX_FATFS_Init();

